Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Each Span contains its own text and style properties for that text.
it_it: Ogni Span contiene il proprio testo e le proprie proprietà di stile.

source: Each Span so added is appended to the end of the list.
it_it: Ogni Span aggiunto viene posto alla fine dell'elenco.

source: Each Subject represents a single "datum" in the application, that UI elements (Widgets and Components) can "observe" and reflect visually.
it_it: Ogni Subject rappresenta un singolo "dato" nell'applicazione, che gli elementi dell'Interfaccia Utente (Widget e Componenti) possono "osservare" e riflettere visivamente.

source: Each XML file describes a :ref:`Screen <screens>`.
it_it: Ogni file XML descrive una :ref:`Schermata <screens>`.

source: Each ``<prop>`` is mapped to a ``set`` function.
it_it: Ogni ``<prop>`` viene mappata a una funzione ``set``.

source: Each ``<translation>`` defines a ``tag``, which acts as the lookup key, and attributes for each language.
it_it: Ogni ``<translation>`` definisce un ``tag``, che funge da chiave di ricerca, e attributi per ciascuna lingua.

source: Each accelerator has its own context that allows them to be used individually as well simultaneously (in LVGL multithreading mode).
it_it: Ogni acceleratore ha un proprio contesto che ne consente l'utilizzo sia singolarmente che simultaneamente (in modalità LVGL multithreading).

source: Each button's behavior can be customized with the following control flags:
it_it: Il comportamento di ogni pulsante può essere personalizzato con i seguenti flag di controllo:

source: Each chart has the following attributes (over and above attributes found in :ref:`all Widgets <base_widget>`):
it_it: Ogni chart ha i seguenti attributi (oltre agli attributi presenti in :ref:`tutti i Widget <base_widget>`):

source: Each child of ``<fonts>`` starts with the desired font engine's name, a ``name`` property, and other properties depending on the selected engine.
it_it: Ogni elemento figlio di ``<fonts>`` inizia col nome del motore del font desiderato, una proprietà ``name`` e altre proprietà a seconda del motore selezionato.

source: Each component corresponds to a specific package or dependency that is staged into the sysroot.
it_it: Ogni componente corrisponde a un pacchetto o dipendenza specifica che viene inserita nella sysroot.

source: Each create function has a single ``parent`` argument that defines which widget the new one will be added to.
it_it: Ogni funzione *create* ha un singolo argomento ``parent`` che definisce a quale widget verrà aggiunto quello nuovo.

source: Each cursor (if there are any):
it_it: Ogni cursore (se presente):

source: Each data series:
it_it: Ogni serie di dati:

source: Each example assumes LVGL has undergone normal initialization, meaning that a ``lv_display_t`` object was created and therefore has an :ref:`active_screen`.
it_it: Ogni esempio presuppone che LVGL abbia subìto una normale inizializzazione, ovvero che sia stato creato un oggetto ``lv_display_t`` e che quindi abbia :ref:`active_screen`.

source: Each folder corresponds to components relevant to the specific architecture, and they collectively form the complete environment needed to compile and run software for the target and host systems.
it_it: Ogni cartella corrisponde a componenti rilevanti per l'architettura specifica e, nel loro insieme, formano l'ambiente completo necessario per compilare ed eseguire il software per i sistemi target e host.

source: Each folder utility will be explained throughout the guide.
it_it: Ogni utilità di gestione cartelle verrà spiegata nel corso della guida.

source: Each individual gradient consumes around 4K of GPU memory pool.
it_it: Ogni singolo gradiente consuma circa 4 KB di memoria della GPU.

source: Each key can be customized by using draw events such as :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`.
it_it: Ogni tasto può essere personalizzato utilizzando eventi di disegno come :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`.

source: Each line's buttons have their width calculated automatically.
it_it: La larghezza dei pulsanti di ogni riga viene calcolata automaticamente.

source: Each list is terminated by the next ..
it_it: Ogni elenco termina con la successiva pseudo-direttiva ..

# Each list item should be separated by `` ``.
source: Each list item should be separated by ``\n``.
it_it: Ogni elemento dell'elenco deve essere separato da ``\n``.

source: Each open file will buffer up to that many bytes to reduce the number of FS driver calls.
it_it: Ogni file aperto memorizzerà nel buffer fino a quel numero di byte per ridurre il numero di chiamate al driver FS.

source: Each package (or "recipe") that BitBake processes generates temporary files and directories inside this ``work`` folder.
it_it: Ogni pacchetto (o "recipe" [ricetta]) elaborato da BitBake genera file e directory temporanei all'interno di questa cartella ``work``.

source: Each package has its own subdirectory within the ``build`` folder, where the build process takes place.
it_it: Ogni pacchetto ha una propria sottodirectory all'interno della cartella ``build``, dove avviene il processo di compilazione.

source: Each page mentions if/how they can be used with each other.
it_it: Ciascuna pagina indica se/come possono essere utilizzate insieme.

source: Each time you re-export your project from the LVGL Editor, these files are regenerated, so repeat Step 3.
it_it: Ogni volta che si riesporta il ​​progetto dall'editor LVGL, questi file vengono rigenerati, quindi ripetere il ​​passaggio 3.

source: Earliest data series added appears on top.
it_it: Le prime serie di dati aggiunte appaiono in alto.

source: Easily apply width/height/etc. to multiple widgets.
it_it: Applicare facilmente larghezza/altezza/ecc. a più widget.

source: Edit ``/boot/cmdline.txt`` file.
it_it: Modificare il file ``/boot/cmdline.txt``.

source: Edit ``lv_conf.h`` and ``lv_drv_conf.h`` to configure LVGL.
it_it: Modificare ``lv_conf.h`` e ``lv_drv_conf.h`` per configurare LVGL.

source: Edit ``lv_conf.h`` to configure LVGL.
it_it: Modificare ``lv_conf.h`` per configurare LVGL.

source: Edit and Navigate Mode
it_it: Modalità Modifica e Navigazione

source: Edit files to use:
it_it: Modificare i file da utilizzare:

source: Editor Pane
it_it: Pannello "Editor"

source: Efficiency
it_it: Efficienza

source: Efficient display rotation is fully supported through :cpp:func:`lv_display_set_rotation`.
it_it: La rotazione efficiente del display è pienamente supportata tramite :cpp:func:`lv_display_set_rotation`.

source: Eg.
it_it: Es.

source: Either the UI or the application can subscribe to these subjects by creating *observer callbacks* that are notified when the subject changes.
it_it: L'interfaccia utente o l'applicazione possono sottoscrivere questi soggetti creando *callback dell'osservatore* che vengono notificati quando il soggetto cambia.

source: Either way, if it equates to a non-zero value, it causes two things to happen:
it_it: In entrambi i casi, se equivale a un valore diverso da zero, si verificano due cose:

source: Either way, the writing of the ``uint32_t`` Tick value must be atomic, which is usually the case with a 32- or 64-bit platform.
it_it: In entrambi i casi, la scrittura del valore Tick ``uint32_t`` deve essere atomica, il che solitamente avviene con una piattaforma a 32 o 64 bit.

source: Elastic scroll
it_it: Scorrimento elastico

source: Elegant code style, easy to use, read and master.
it_it: Stile di codice elegante, facile da usare, leggere e padroneggiare.

source: Element `access` types can be:
it_it: I tipi di elemento `access` possono essere:

source: Elements
it_it: Elementi

source: Elements are also very useful to create "slots" (similar to tabview tabs), like a content and header area for a window widget, where children can be created directly.
it_it: Gli elementi sono anche molto utili per creare "slot" (simili ai tab di una tabview), come un'area di contenuto e intestazione per un widget window, dove è possibile creare direttamente elementi figlio.

source: Elements are created via an ``add`` function:
it_it: Gli elementi vengono creati tramite una funzione ``add``:

source: Elements are described inside the ``<api>`` tag, and they can have ``<arg>`` and ``<prop>`` children:
it_it: Gli elementi sono descritti all'interno del tag ``<api>`` e possono avere elementi figlio ``<arg>`` e ``<prop>``:

source: Elements are internal parts of the Widget that can be accessed and/or created dynamically.
it_it: Gli elementi sono parti interne del widget a cui è possibile accedere e/o creare dinamicamente.

source: Elements are referenced as ``<widget-element>`` in the ``<view>``.
it_it: Gli elementi sono referenziati come ``<widget-element>`` in ``<view>``.

source: Else, there will be logged just an error message via `LV_LOG_ERROR`.
it_it: In caso contrario, verrà registrato solo un messaggio di errore tramite `LV_LOG_ERROR`.

source: Embedded Oriented
it_it: Orientato agli Embedded

source: Embedded Platforms
it_it: Piattaforme Embedded

source: Embedded Smart Displays
it_it: Display Intelligenti Embedded

source: Emissive materials for glowing effects and self-illuminated surfaces
it_it: Materiali emissivi per effetti luminosi e superfici autoilluminate

source: Emphasis using *italics*.
it_it: Enfasi con *corsivo*.

source: Emphasis using **boldface**.
it_it: Enfasi con **grassetto**.

source: Empirically, a tolerance of 32 bytes is recommended.
it_it: Empiricamente, si consiglia una tolleranza di 32 byte.

source: Enable :c:macro:`LV_USE_FRAGMENT` in ``lv_conf.h``.
it_it: Abilitare :c:macro:`LV_USE_FRAGMENT` in ``lv_conf.h``.

source: Enable :c:macro:`LV_USE_FS_ARDUINO_ESP_LITTLEFS` and define a :c:macro:`LV_FS_ARDUINO_ESP_LITTLEFS_LETTER` in ``lv_conf.h``.
it_it: Abilitare :c:macro:`LV_USE_FS_ARDUINO_ESP_LITTLEFS` e definire una :c:macro:`LV_FS_ARDUINO_ESP_LITTLEFS_LETTER` in ``lv_conf.h``.

source: Enable :c:macro:`LV_USE_FS_ARDUINO_SD` and define a :c:macro:`LV_FS_ARDUINO_SD_LETTER` in ``lv_conf.h``.
it_it: Abilitare :c:macro:`LV_USE_FS_ARDUINO_SD` e definire una :c:macro:`LV_FS_ARDUINO_SD_LETTER` in ``lv_conf.h``.

source: Enable :c:macro:`LV_USE_IME_PINYIN` in ``lv_conf.h``.
it_it: Abilitare :c:macro:`LV_USE_IME_PINYIN` in ``lv_conf.h``.

source: Enable :c:macro:`LV_USE_IMGFONT` in ``lv_conf.h``.
it_it: Abilitare :c:macro:`LV_USE_IMGFONT` in ``lv_conf.h``.

source: Enable :c:macro:`LV_USE_QRCODE` in ``lv_conf.h`` by setting its value to ``1``.
it_it: Abilitare :c:macro:`LV_USE_QRCODE` in ``lv_conf.h`` impostandone il valore a ``1``.

source: Enable :c:macro:`LV_USE_SVG` in ``lv_conf.h`` by setting its value to ``1``.
it_it: Abilitare :c:macro:`LV_USE_SVG` in ``lv_conf.h`` impostandone il valore a ``1``.

source: Enable :c:macro:`LV_USE_VG_LITE_THORVG` and set :c:macro:`LV_DRAW_BUF_ALIGN` to 64.
it_it: Abilitare :c:macro:`LV_USE_VG_LITE_THORVG` e impostare :c:macro:`LV_DRAW_BUF_ALIGN` a 64.

source: Enable :ref:`logging`.
it_it: Abilitare :ref:`logging`.

source: Enable FreeType and Font Manager in ``lv_conf.h`` by setting the :c:macro:`LV_USE_FONT_MANAGER` macros to non-zero values, and configure :c:macro:`LV_FONT_MANAGER_NAME_MAX_LEN` to set the maximum length of the font name.
it_it: Si abilitano FreeType e Font Manager in ``lv_conf.h`` impostando le macro :c:macro:`LV_USE_FONT_MANAGER` su valori diversi da zero e configurando :c:macro:`LV_FONT_MANAGER_NAME_MAX_LEN` per impostare la lunghezza massima del nome del font.

source: Enable G2D asserts in "lv_conf.h": Set :c:macro:`LV_USE_G2D_ASSERT` to `1`.
it_it: Abilitare le asserzioni G2D in "lv_conf.h": Impostare :c:macro:`LV_USE_G2D_ASSERT` a `1`.

source: Enable PXP asserts in "lv_conf.h": Set :c:macro:`LV_USE_PXP_ASSERT` to `1`.
it_it: Abilitare le asserzioni PXP in "lv_conf.h": Impostare :c:macro:`LV_USE_PXP_ASSERT` a `1`.

source: Enable QNX support:
it_it: Abilitare il supporto QNX:

source: Enable SDL driver support in ``lv_conf.h``, via CMake compiler definitions, or by using KConfig.
it_it: Abilitare il supporto per i driver SDL in ``lv_conf.h``, tramite le definizioni del compilatore CMake o utilizzando KConfig.

source: Enable SSH in ``target-packages > Networking applications > openssh``
it_it: Abilitare SSH in ``target-packages > Networking applications > openssh``

source: Enable ThorVG and turn on the configuration :c:macro:`LV_USE_THORVG_INTERNAL` or :c:macro:`LV_USE_THORVG_EXTERNAL`.
it_it: Abilitare ThorVG e attivare la configurazione :c:macro:`LV_USE_THORVG_INTERNAL` o :c:macro:`LV_USE_THORVG_EXTERNAL`.

source: Enable VG-Lite rendering backend, see :ref:`vg_lite`.
it_it: Abilitare il backend di rendering VG-Lite, vedere :ref:`vg_lite`.

source: Enable VGLite asserts in "lv_conf.h": Set :c:macro:`LV_USE_VGLITE_ASSERT` to `1`.
it_it: Abilitare le asserzioni VGLite in "lv_conf.h": Impostare :c:macro:`LV_USE_VGLITE_ASSERT` a `1`.

source: Enable VGLite blit split in "lv_conf.h": Set :c:macro:`LV_USE_VGLITE_BLIT_SPLIT` to `1`.
it_it: Abilitare la divisione blit VGLite in "lv_conf.h": Impostare :c:macro:`LV_USE_VGLITE_BLIT_SPLIT` a `1`.

source: Enable VGLite draw task synchronously in "lv_conf.h": Set :c:macro:`LV_USE_VGLITE_DRAW_ASYNC` to `1`.
it_it: Abilitare l'attività di disegno VGLite in modo sincrono in "lv_conf.h": Impostare :c:macro:`LV_USE_VGLITE_DRAW_ASYNC` a `1`.

source: Enable Widget ID functionality by setting :c:macro:`LV_USE_OBJ_ID` to ``1`` in ``lv_conf.h``.
it_it: La funzionalità ID Widget si abilita impostando :c:macro:`LV_USE_OBJ_ID` a ``1`` in ``lv_conf.h``.

source: Enable Windows driver support in ``lv_conf.h``, via CMake compiler define, or KConfig:
it_it: Abilitare il supporto del driver Windows in ``lv_conf.h``, tramite la definizione del compilatore CMake o KConfig:

source: Enable ``LV_USE_DRAW_ARM2D_SYNC 1`` and ``LV_USE_DRAW_SW_ASM LV_DRAW_SW_ASM_HELIUM`` in ``lv_conf.h``.
it_it: Abilitare ``LV_USE_DRAW_ARM2D_SYNC 1`` e ``LV_USE_DRAW_SW_ASM LV_DRAW_SW_ASM_HELIUM`` in ``lv_conf.h``.

source: Enable and Disable
it_it: Abilitazione e Disabilitazione

source: Enable assertions in ``lv_conf.h`` (``LV_USE_ASSERT_...``).
it_it: Abilitare le asserzioni in ``lv_conf.h`` (``LV_USE_ASSERT_...``).

source: Enable clipping of content that overflows rounded corners of parent Widget.
it_it: Abilita il clipping del contenuto che eccede gli angoli arrotondati del Widget padre.

source: Enable file system support for the volume the application was loaded from (defaults to drive letter ``E``):
it_it: Abilitare il supporto del file system per il volume da cui è stata caricata l'applicazione (per default, la lettera di unità ``E``):

source: Enable glTF Support
it_it: Abilitare il Supporto glTF

source: Enable if LVGL will be installed to the system or your build system uses a sysroot.
it_it: Abilitare se LVGL verrà installato sul sistema o se il sistema di build utilizza una sysroot.

source: Enable in ``lv_conf.h``:
it_it: Abilitare in ``lv_conf.h``:

source: Enable it by setting the :cpp:enumerator:`LV_OBJ_FLAG_SEND_DRAW_TASK_EVENTS` flag on the Widget(s) you wish to emit this event.
it_it: Abilitarlo impostando il flag :cpp:enumerator:`LV_OBJ_FLAG_SEND_DRAW_TASK_EVENTS` sul/sui Widget che debbano emettere questo evento.

source: Enable text recoloring with :cpp:expr:`lv_arclabel_set_recolor(arclabel, true)`.
it_it: Abilitare la ricolorazione del testo con :cpp:expr:`lv_arclabel_set_recolor(arclabel, true)`.

source: Enable the DRM driver support in ``lv_conf.h``, by CMake compiler define, or by KConfig:
it_it: Abilitare il supporto del driver DRM in ``lv_conf.h``, tramite la definizione del compilatore CMake o tramite KConfig:

source: Enable the G2D backend in ``lv_conf.h``:
it_it: Abilitare il backend G2D in ``lv_conf.h``:

source: Enable the ILI9341 driver support in lv_conf.h, by cmake compiler define or by KConfig:
it_it: Abilitare il supporto del driver ILI9341 in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig:

source: Enable the Linux LVGL evdev driver support in ``lv_conf.h``.
it_it: Abilitare il supporto del driver evdev LVGL Linux in ``lv_conf.h``.

source: Enable the NV3007 driver support in lv_conf.h, by cmake compiler define or by KConfig:
it_it: Abilitare il supporto del driver NV3007 in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig:

source: Enable the OpenGL driver support in lv_conf.h, by cmake compiler define or by KConfig
it_it: Abilitare il supporto del driver OpenGL in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig

source: Enable the ST7735 driver support in lv_conf.h, by cmake compiler define or by KConfig:
it_it: Abilitare il supporto del driver ST7735 in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig:

source: Enable the ST7789 driver support in lv_conf.h, by cmake compiler define or by KConfig:
it_it: Abilitare il supporto del driver ST7789 in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig:

source: Enable the ST7796 driver support in lv_conf.h, by cmake compiler define or by KConfig:
it_it: Abilitare il supporto del driver ST7796 in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig:

source: Enable the UEFI driver support in ``lv_conf.h``:
it_it: Abilitare il supporto del driver UEFI in ``lv_conf.h``:

source: Enable the Wayland driver in ``lv_conf.h`` with ``LV_USE_WAYLAND 1``
it_it: Abilitare il driver Wayland in ``lv_conf.h`` con ``LV_USE_WAYLAND 1``

source: Enable the X11 driver support in lv_conf.h, by cmake compiler define or by KConfig
it_it: Abilitare il supporto del driver X11 in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig

source: Enable the built-in profiler functionality by setting :c:macro:`LV_USE_PROFILER_BUILTIN`.
it_it: Abilitare la funzionalità del profiler integrata impostando :c:macro:`LV_USE_PROFILER_BUILTIN`.

source: Enable the following option in your ``lv_conf.h`` (or via Kconfig/CMake):
it_it: Abilitare la seguente opzione in ``lv_conf.h`` (o tramite Kconfig/CMake):

source: Enable the framebuffer driver support in lv_conf.h, by cmake compiler define or by KConfig. Additionally you may configure the rendering mode.
it_it: Abilitare il supporto del driver framebuffer in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig. È inoltre possibile configurare la modalità di rendering.

source: Enable the generic MIPI LCD driver support in lv_conf.h, by cmake compiler define or by KConfig
it_it: Abilitare il supporto del driver LCD MIPI generico in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig.

source: Enable the libinput driver support in lv_conf.h, by cmake compiler define or by KConfig.
it_it: Abilitare il supporto del driver libinput in lv_conf.h, tramite la definizione del compilatore cmake o tramite KConfig.

source: Enable the memory core functions, which are wrappers around ``AllocatePool`` and ``FreePool`` (using memory of type *EfiBootServicesData*) if you do not wan't to use your own implementations
it_it: Abilitare le funzioni core della memoria, che fungono da wrapper per ``AllocatePool`` e ``FreePool`` (utilizzando memoria di tipo *EfiBootServicesData*) se non si desidera utilizzare implementazioni personalizzate.

source: Enable the renderer by setting :c:macro:`LV_USE_NEMA_GFX` to ``1`` in lv_conf.h.
it_it: Abilitare il renderer impostando :c:macro:`LV_USE_NEMA_GFX` a ``1`` in lv_conf.h.

source: Enable the wayland driver in ``lv_conf.h``
it_it: Abilitare il driver Wayland in ``lv_conf.h``

source: Enables reading from and writing to SD cards.
it_it: Abilita la lettura e la scrittura su schede SD.

source: Enables style transitions to animate size/position changes between states.
it_it: Abilitare le transizioni di stile per animare le variazioni di dimensione/posizione tra gli stati.

source: Enabling LVGL logs on IDF project
it_it: Abilitazione dei log LVGL sul progetto IDF

source: Enabling LVGL's STDIO file system in the configuration
it_it: Abilitazione del file system STDIO di LVGL nella configurazione

source: Enabling anti-aliasing causes the transformations to be of higher quality, but slower.
it_it: L'attivazione dell'anti-aliasing rende le trasformazioni di qualità superiore, ma più lente.

source: Enabling the blit split workaround will mitigate any quality degradation issue on screen's dimension > 352 pixels.
it_it: Abilitando la soluzione alternativa per la divisione blit si attenuerà qualsiasi problema di degradazione della qualità su schermi con dimensioni superiori a 352 pixel.

source: Encoder monkey example
it_it: Esempio di "encoder monkey"

source: Ending angle.
it_it: Angolo finale.

source: Enforcement
it_it: Applicazione

source: Enjoy detailed code hints down to the parameter type for a better programming experience.
it_it: Utilizzare suggerimenti dettagliati sul codice fino al tipo di parametro per una migliore esperienza di programmazione.

source: Ensure that an ``lv_display_t`` object is already created for ``disp``.
it_it: Assicurarsi che un oggetto ``lv_display_t`` sia già stato creato per ``disp``.

source: Ensure that the LCD controller is configured accordingly.
it_it: Assicurarsi che il controller LCD sia configurato di conseguenza.

source: Ensure that the folder containing ``arm_2d_cfg.h`` is added to the include path.
it_it: La cartella che contiene ``arm_2d_cfg.h`` dev'essere aggiunta al path dell'include.

source: Ensure the callback always returns a valid index (0 to ``mode_count - 1``).
it_it: Assicurarsi che la callback restituisca sempre un indice valido (da 0 a ``mode_count - 1``).

source: Ensure there is enough ram for the blob.
it_it: Assicurarsi che ci sia RAM sufficiente per il blob.

source: Ensuring Time Updates are Atomic
it_it: Garantire che gli Aggiornamenti Temporali Siano Atomici

source: Enter the FreeType source code directory
it_it: Accedere alla directory del codice sorgente di FreeType

source: Enums
it_it: Enum

source: Enums: ``type="dir(top bottom)"``
it_it: Enum: ``type="dir(top bottom)"``

source: Environment Images
it_it: Immagini Ambientali

source: Environment creation processes the source image into cube map data, which takes more time with larger resolution values
it_it: La creazione dell'ambiente elabora l'immagine sorgente in dati della mappa del cubo, operazione che richiede più tempo con valori di risoluzione più elevati.

source: Environment-based backgrounds using IBL
it_it: Background basati sull'ambiente utilizzando IBL

source: Equivalent to "%d".
it_it: Equivalente a "%d".

source: Espressif System also provides its comprehensive software development kit (SDK) for users to focus only in their applications, which is the IDF, all other 3rd party support such as Arduino, Zephyr, NuttX and Micropython are built on top of the IDF or some of its components.
it_it: Espressif Systems fornisce anche il suo kit di sviluppo software (SDK) completo, ovvero l'IDF, per consentire agli utenti di concentrarsi esclusivamente sulle proprie applicazioni. Tutti gli altri supporti di terze parti, come Arduino, Zephyr, NuttX e Micropython, sono basati sull'IDF o su alcuni dei suoi componenti.
